app/views/users/account.html.erb

SELECT  "bids".* FROM "bids" WHERE "bids"."user_id" = $1  ORDER BY "bids"."id" DESC LIMIT 10  [["user_id", 5]]
---
  <% if @user.bids_count > 0 %>
    <% @user.bids.sort_by{|t| - t.created_at.to_i}.last(10).each do |bid| %>