app/controllers/bids_controller.rb

  def create
    @bid = @current_user.bids.new(params.require(:bid).permit(:price, :house_id))
    @house = House.find_by(zillow_id: params[:house][:zillow_id])
    if @house
      @old_bid = @house.bids.last
    else
      @house = House.create(params.require(:house).permit(:zillow_id, :address, :city, :state, :zip))
    end
    @bid.house_id = @house.id
    if @old_bid && @old_bid.user.id == @current_user.id
      render json: {notice: "You are currently the higest bidder on this house and can not place another bid."}
    else
        if @bid.price < (@house.bids.maximum(:price) || 0)
          render json: {notice: "Bid placed must be higher than highest bid of #{@house.bids.maximum(:price)}"}
       else
          if @bid.save
            if @house.bids.count > 1
---
SELECT  "bids".* FROM "bids" WHERE "bids"."house_id" = $1  ORDER BY "bids"."id" DESC LIMIT 1  [["house_id", 6]]
INSERT INTO "bids" ("price", "user_id", "house_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["price", 567], ["user_id", 8], ["house_id", 1], ["created_at", "2016-02-03 19:28:16.839146"], ["updated_at", "2016-02-03 19:28:16.839146"]]
INSERT INTO "houses" ("zillow_id", "address", "city", "state", "zip", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "houses".* FROM "houses" WHERE "houses"."zillow_id" = $1 LIMIT 1  [["zillow_id", 63336150]]
SELECT MAX("bids"."price") FROM "bids" WHERE "bids"."house_id" = $1  [["house_id", 31]]
SELECT COUNT(*) FROM "bids" WHERE "bids"."house_id" = $1  [["house_id", 8]]

  def delete
    @bid = Bid.find(params[:id])
    @bid.destroy
---
SELECT  "bids".* FROM "bids" WHERE "bids"."id" = $1 LIMIT 1  [["id", 104]]
DELETE FROM "bids" WHERE "bids"."id" = $1  [["id", 104]]